// 1. все задачи делать через дестриктурицацию
// 2. Залогировать то что получилось

const genshinHero = {
  attackPhrase: "Я атакую!!!",
  protectPhrase: "Я защищаюсь",
};

// Задание 1 - создать героя zhongLi, скопировать в него свойства из genshinHero и добавить поле name с именем

// Задание 2 - создать героя artem, скопировать  в него свойства из genshinHero и добавить поле name с именем + переопределить attackPhrase на свою

// Задание 3 - создать героя zhongLiUltra, по аналогии с задание 1, добавит к нему свойства ultra
const ultra = {
  ultraAttack: "Ультра аттака",
  ultraHelth: "Ультра здоровье",
};
